fio-test/results/seq_read_out_16/64k-libaio.out
job1: (g=0): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=21748: Thu Jun 13 21:13:33 2024
  read: IOPS=32.7k, BW=2045MiB/s (2145MB/s)(673GiB/337000msec)
    slat (usec): min=9, max=713, avg=64.82, stdev=25.73
    clat (nsec): min=539, max=849699, avg=170604.74, stdev=49313.60
     lat (usec): min=30, max=944, avg=235.93, stdev=62.43
    clat percentiles (usec):
     |  1.00th=[  112],  5.00th=[  119], 10.00th=[  122], 20.00th=[  127],
     | 30.00th=[  133], 40.00th=[  137], 50.00th=[  147], 60.00th=[  165],
     | 70.00th=[  217], 80.00th=[  229], 90.00th=[  239], 95.00th=[  249],
     | 99.00th=[  273], 99.50th=[  293], 99.90th=[  343], 99.95th=[  359],
     | 99.99th=[  388]
   bw (  MiB/s): min= 1803, max= 2393, per=100.00%, avg=2078.75, stdev=14.55, samples=5301
   iops        : min=28856, max=38296, avg=33259.85, stdev=232.78, samples=5301
  lat (nsec)   : 750=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.02%
  lat (usec)   : 100=0.18%, 250=95.35%, 500=4.45%, 750=0.01%, 1000=0.01%
  cpu          : usr=2.09%, sys=17.34%, ctx=22055808, majf=0, minf=528
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=11028480,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2045MiB/s (2145MB/s), 2045MiB/s-2045MiB/s (2145MB/s-2145MB/s), io=673GiB (723GB), run=337000-337000msec

Disk stats (read/write):
    dm-0: ios=11026372/0, merge=0/0, ticks=2404996/0, in_queue=2404996, util=100.00%, aggrios=8822784/0, aggrmerge=0/0, aggrticks=1578354/0, aggrin_queue=1578354, aggrutil=100.00%
  nvme1n2: ios=8822784/0, merge=0/0, ticks=1583738/0, in_queue=1583739, util=100.00%
  nvme4n2: ios=8822784/0, merge=0/0, ticks=1549009/0, in_queue=1549009, util=100.00%
  nvme0n2: ios=8822784/0, merge=0/0, ticks=1647552/0, in_queue=1647552, util=100.00%
  nvme3n2: ios=8822784/0, merge=0/0, ticks=1574320/0, in_queue=1574320, util=100.00%
  nvme2n2: ios=8822784/0, merge=0/0, ticks=1537152/0, in_queue=1537152, util=100.00%